app/Controllers/Biodata.php

UPDATE "users" SET "change_by" = '4', "url_photo" = 'assets/avatar_file/1676780075WhatsApp Image 2023-02-09 at 14.36.33.jpeg', "updated_at" = '2023-02-19 04:14:35'
WHERE "username" = 'ananghanafi'
---
    public function save_avatar()
    {
        try {

            if (!is_dir('assets/avatar_file/')) {
                mkdir('./assets/avatar_file/', 0777, TRUE);
            }
            $target_dir = "assets/avatar_file/";
            $target_file = $target_dir . time() . basename($_FILES["avatar_file"]["name"]);
            $FileType = strtolower(pathinfo($target_file, PATHINFO_EXTENSION));
            if (move_uploaded_file($_FILES["avatar_file"]["tmp_name"], $target_file)) {
                $data = array(
                    'change_by' => session('user_id'),
                    "url_photo" => $target_file,
                    "updated_at" => date("Y-m-d H:i:s")
                );

                $this->db()->table('users')->where('username', session('username'))->update($data);